Quiz-App/app/views/quiz_stats/new.html.erb

<% sno = 1 %>
<% Question.distinct(:genre).pluck(:genre).each do |category| %>
	<% a = Question.where(genre: category).select(:subgenre).map(&:subgenre).uniq %>
---
SELECT DISTINCT "questions"."genre" FROM "questions"
SELECT "questions"."subgenre" FROM "questions" WHERE "questions"."genre" = ?  [["genre", "G.K."]]

		<td><%= items %></td>
		<% user_stat = UserStat.where(user_id: session[:user_id] ,									genre: category ,subgenre: items) %>
---
SELECT "user_stats".* FROM "user_stats" WHERE "user_stats"."user_id" = ? AND "user_stats"."genre" = ? AND "user_stats"."subgenre" = ?  [["user_id", 2], ["genre", "G.K."], ["subgenre", "GEOGRAPHY"]]