Quiz-App/app/controllers/leader_board_controller.rb

SELECT "user_stats".* FROM "user_stats" WHERE "user_stats"."genre" = ? AND "user_stats"."subgenre" = ? ORDER BY "user_stats"."score" DESC  [["genre", "G.K."], ["subgenre", "GEOGRAPHY"]]
---
  def user_render
    $user = UserStat.order(score: :desc).where(genre: params[:genre] , subgenre: params[:subgenre])