Quiz-App/app/controllers/play_controller.rb

  def play
  	@question = Question.new
  	user_stat = UserStat.where(user_id: session[:user_id] , genre: params[:genre] ,
  						 			subgenre: params[:subgenre])
  	if(user_stat.empty? == true)
  		$user = UserStat.new(user_id: session[:user_id] , genre: params[:genre] ,
  						 			subgenre: params[:subgenre] , last_ques: 0 , score: 0)
  		$user.save()
  	end
  	$user = UserStat.where(user_id: session[:user_id] , genre: params[:genre] ,
  						 			subgenre: params[:subgenre])

  	if (params[:restore].to_i == 0)
  		$user[0].last_ques = 0
  		$user[0].score = 0
  		$user[0].save()
---
SELECT "user_stats".* FROM "user_stats" WHERE "user_stats"."user_id" = ? AND "user_stats"."genre" = ? AND "user_stats"."subgenre" = ?  [["user_id", 2], ["genre", "G.K."], ["subgenre", "GEOGRAPHY"]]
INSERT INTO "user_stats" ("user_id", "genre", "subgenre", "last_ques", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["genre", "G.K."], ["subgenre", "GEOGRAPHY"], ["last_ques", 0], ["score", 0], ["created_at", "2017-09-17 16:44:38.312693"], ["updated_at", "2017-09-17 16:44:38.312693"]]
UPDATE "user_stats" SET "last_ques" = ?, "score" = ?, "updated_at" = ? WHERE "user_stats"."id" = ?  [["last_ques", 0], ["score", 0], ["updated_at", "2017-09-17 17:20:24.433986"], ["id", 1]]

  def check
  	@question = Question.new
  	a = Question.where(genre: params[:genre] , subgenre: params[:subgenre])
---
SELECT "questions".* FROM "questions" WHERE "questions"."genre" = ? AND "questions"."subgenre" = ?  [["genre", "G.K."], ["subgenre", "GEOGRAPHY"]]