Quiz-App/app/controllers/question_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("question", "option1", "option2", "option3", "option4", "genre", "a1", "a2", "a3", "a4", "created_at", "updated_at", "subgenre") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)