Quiz-App/app/views/play/new.html.erb

<h1> Select A Genre and Sub-Genre </h1>
<% Question.distinct(:genre).pluck(:genre).each do |category| %>
	<h3> <%= category %></h3>
	<% a = Question.where(genre: category).select(:subgenre).map(&:subgenre).uniq %>
---
SELECT "genres"."genre" FROM "genres"
SELECT DISTINCT "questions".* FROM "questions" WHERE "questions"."genre" = ?  [["genre", "G.K."]]
SELECT "questions"."subgenre" FROM "questions" WHERE "questions"."genre" = ?  [["genre", "G.K."]]