Quiz-App/app/views/play/play.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."genre" = ? AND "questions"."subgenre" = ?  [["genre", "Cricket"], ["subgenre", "crick1"]]
---
<br><br>
<% a = Question.where(genre: params[:genre] , subgenre: params[:subgenre]) %>