Quiz-App/app/views/leader_board/user.html.erb

<h1>Leader Board</h1>
<% Question.distinct(:genre).pluck(:genre).each do |category| %>
        <h3> <%= category %></h3>
        <% a = Question.where(genre: category).select(:subgenre).map(&:subgenre).uniq %>
---
SELECT DISTINCT "questions"."genre" FROM "questions"
SELECT "questions"."subgenre" FROM "questions" WHERE "questions"."genre" = ?  [["genre", "G.K."]]