Quiz-App/app/views/leader_board/user_render.html.erb

        <td><%= a %></td>
        <td><%= User.where(id: item.user_id)[0].name %><td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 3]]